// This query identifies internal devices communicating with known malicious IP addresses from an external threat intelligence feed.  
// It retrieves a list of malicious IPs and checks for matches in DeviceNetworkEvents over the past 90 days.  

let _OSINT = externaldata (IP:string) [@"https://raw.githubusercontent.com/stamparm/ipsum/master/levels/6.txt"];
DeviceNetworkEvents
| where TimeGenerated >= ago(90d)
    and RemoteIP in (_OSINT)
| summarize ConnectionCount = count(), IPAddresses = makelist(RemoteIP) by DeviceName
